mikeakohn/naken_asm/asm/dspic.cpp
/**
 *  naken_asm assembler.
 *  Author: Michael Kohn
 *   Email: mike@mikekohn.net
 *     Web: https//www.mikekohn.net/
 * License: GPLv3
 *
 * Copyright 2010-2026 by Michael Kohn
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <ctype.h>

#include "asm/common.h"
#include "asm/dspic.h"
#include "core/AsmContext.h"
#include "core/tokens.h"
#include "core/eval_expression.h"
#include "disasm/dspic.h"
#include "table/dspic.h"

enum
{
  OPTYPE_ERROR,
  OPTYPE_REGISTER,
  OPTYPE_WREG,
  OPTYPE_LIT,
  OPTYPE_NUM,
  //OPTYPE_INDEX,
  //OPTYPE_INDEX_PRE_INC,
  //OPTYPE_INDEX_PRE_DEC,
  //OPTYPE_INDEX_POST_INC,
  //OPTYPE_INDEX_POST_DEC,
  OPTYPE_ACCUM,
  OPTYPE_W_PLUS_LIT,
  //OPTYPE_W_PLUS_W,   <-- hmmm
  OPTYPE_W_OP_EQ_NUM,
  //OPTYPE_W_MINUS_EQ_KX,
  //OPTYPE_W_PLUS_EQ_KX,
  //OPTYPE_W_MINUS_EQ_KY,
  //OPTYPE_W_PLUS_EQ_KY,
  OPTYPE_W_MUL_W,
};

static int is_condition(char *token)
{
  const char *cond[] =
  {
    "c",   "ge", "geu", "gt", "gtu", "le",
    "leu", "lt", "ltu", "n",  "nc",  "nn",
    "nov", "nz", "oa",  "ob", "ov",  "sa",
    "sb",  "z", NULL
  };

  int n;

  n = 0;
  while (cond[n] != NULL)
  {
    if (strcasecmp(cond[n], token) == 0) { return 1; }
    n++;
  }

  return 0;
}

#define REG_NORMAL 0
#define REG_INDIRECT 1
#define REG_INDIRECT_POST_DEC 2
#define REG_INDIRECT_POST_INC 3
#define REG_INDIRECT_PRE_DEC 4
#define REG_INDIRECT_PRE_INC 5
#define REG_INDIRECT_W_PLUS_W 6

struct _operand
{
  int value;
  int type;
  int attribute;
  int reg2;
};

static int get_register_dspic(char *token)
{
  if (token[0] == 'w' || token[0] == 'W')
  {
    if (token[2] == 0 && (token[1] >= '0' && token[1] <= '9'))
    {
      return token[1] - '0';
    }
      else
    if (token[3] == 0 && token[1]=='1' && (token[2] >= '0' && token[2] <= '5'))
    {
      return 10 + (token[2] - '0');
    }
  }

  if (strcasecmp(token, "wreg") == 0) { return 0; }
  if (strcasecmp(token, "sp") == 0) { return 15; }

  return -1;
}

static int check_f(AsmContext *asm_context, int value)
{
  if ((value & 1) != 0)
  {
    print_error(asm_context, "Address not on 16 bit boundary");
    return -1;
  }

  if (value < 0 || value > 0xffff)
  {
    print_error_range(asm_context, "Address", 0, 0xffff);
    return -1;
  }

  return 0;
}

static int check_f_flag(AsmContext *asm_context, int value, int flag)
{
  if (flag != FLAG_B && (value & 1) != 0)
  {
    print_error(asm_context, "Address not on 16 bit boundary");
  }

  if (value < 0 || value > 0x1fff)
  {
    print_error_range(asm_context, "Address", 0, 0x1fff);
    return -1;
  }

  return 0;
}

static int check_f_64k(AsmContext *asm_context, int value)
{
  if ((value & 1) != 0)
  {
    print_error(asm_context, "Address not on 16 bit boundary");
  }

  if (value < 0 || value > 0xfffe)
  {
    print_error_range(asm_context, "Address", 0, 0xfffe);
    return -1;
  }

  return 0;
}

static int parse_wx_wy(struct _operand *operands, int w, int *iiii)
{
  int num;

  if (operands->type == OPTYPE_REGISTER && operands->attribute == REG_INDIRECT)
  {
    *iiii=(operands->value & 1) == 0 ? 0 : 8;
  }
    else
  if (operands->type == OPTYPE_REGISTER &&
      operands->attribute == REG_INDIRECT_W_PLUS_W &&
      operands->value == w + 1 &&
      operands->reg2 == 12)
  {
    *iiii = 12;
  }
    else
  if (operands->type == OPTYPE_W_OP_EQ_NUM)
  {
    *iiii = (operands->value & 1) == 0 ? 0 : 8;
    num = operands->attribute;
    if ((num & 1) != 0 || num < -6 || num > 6) { return -1; }
    *iiii |= (num / 2) & 0x7;
  }
    else
  {
    return -1;
  }

  return 0;
}

static int parse_dsp_op(struct _operand *operands, int operand, int operand_count, int w, int *xx, int *iiii)
{
  if (operand + 2 > operand_count ||
      operands[operand + 1].value < 4 || operands[operand + 1].value > 7)
  {
    return -1;
  }

  *xx = operands[operand + 1].value - 4;

  return parse_wx_wy(&operands[operand], w, iiii);
}

static int parse_awb(
  AsmContext *asm_context,
  struct _operand *operands,
  int *aa)
{
  if (operands->type == OPTYPE_REGISTER &&
      operands->value == 13 &&
      operands->attribute == REG_NORMAL)
  {
    if (operands->attribute > 1) { return -1; }
    *aa = 0;
  }
    else
  if (operands->type == OPTYPE_W_OP_EQ_NUM &&
      operands->value == 13 &&
      operands->attribute == 2)
  {
    *aa = 1;
  }
    else
  {
    return -1;
  }

  return 0;
}

static int parse_mmm(
  AsmContext *asm_context,
  struct _operand *operands,
  int *mmm)
{
  if (operands->type != OPTYPE_W_MUL_W) { return -1; }
  if (operands->value == 4)
  {
    if (operands->reg2 == 5) { *mmm = 0; }
    else if (operands->reg2 == 6) { *mmm = 1; }
    else if (operands->reg2 == 7) { *mmm = 2; }
    else { return -1; }
  }
    else
  if (operands->value == 5)
  {
    if (operands->reg2 == 6) { *mmm = 4; }
    if (operands->reg2 == 7) { *mmm = 5; }
    else { return -1; }
  }
    else
  if (operands->value == 6 && operands->reg2 == 7)
  {
    *mmm = 6;
  }
    else
  { return -1; }

  return 0;
}

static int parse_mm(
  AsmContext *asm_context,
  struct _operand *operands,
  int *mm)
{
  if (operands->type != OPTYPE_W_MUL_W) { return -1; }
  if (operands->value != operands->reg2) { return -1; }
  if (operands->value < 4 || operands->reg2 > 7) { return -1; }

  *mm=operands->value - 4;

  return 0;
}

static int parse_movsac(
  AsmContext *asm_context,
  struct _operand *operands,
  int operand_count,
  int opcode)
{
int operand = 0;
int xx = 0, yy = 0, iiii = 4, jjjj = 4, aa = 2;

  if (operand_count < 1 ||
      operands[operand].type != OPTYPE_ACCUM) { return -1; }
  opcode |= (operands[operand++].value << 15);

  do
  {
    if (operand >= operand_count) { break; }

    if (operands[operand].value == 8 || operands[operand].value == 9)
    {
      if (parse_dsp_op(operands, operand, operand_count, 8, &xx, &iiii) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (operands[operand].value == 10 || operands[operand].value == 11)
    {
      if (parse_dsp_op(operands, operand, operand_count, 10, &yy, &jjjj) == -1)
      {
        return -1;
      }

