mikeakohn/naken_asm/asm/dspic.cpp
      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (parse_awb(asm_context, &operands[operand], &aa) == -1) { return -1; }

    operand++;

    if (operand < operand_count) { return -1; }

  } while (0);

  opcode |= (xx << 12) | (yy << 10) | (iiii << 6) | (jjjj << 2) | aa;

  return opcode;
}

static int parse_mpy_n(
  AsmContext *asm_context,
  struct _operand *operands,
  int operand_count,
  int opcode)
{
  int operand = 0;
  int xx = 0, yy = 0, iiii = 4, jjjj = 4, mmm = 0;

  if (operand >= operand_count) { return -1; }

  if (parse_mmm(asm_context, operands, &mmm) == -1) { return -1; }

  operand++;

  if (operand >= operand_count) { return -1; }

  if (operands[operand].type != OPTYPE_ACCUM) { return -1; }

  opcode |= (operands[operand++].value << 15);

  do
  {
    if (operand >= operand_count) { break; }

    if (operands[operand].value == 8 || operands[operand].value == 9)
    {
      if (parse_dsp_op(operands, operand, operand_count, 8, &xx, &iiii) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (operands[operand].value == 10 || operands[operand].value == 11)
    {
      if (parse_dsp_op(operands, operand, operand_count, 10, &yy, &jjjj) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand < operand_count) { return -1; }

  } while (0);

  opcode |= (mmm << 16) | (xx << 12) | (yy << 10) | (iiii << 6) | (jjjj << 2);

  return opcode;
}

static int parse_mac_m_m(
  AsmContext *asm_context,
  struct _operand *operands,
  int operand_count,
  int opcode)
{
  int operand = 0;
  int xx = 0, yy = 0, iiii = 4, jjjj = 4, mm = 0;

  if (operand >= operand_count) { return -1; }
  if (parse_mm(asm_context, operands, &mm) == -1) { return -1; }

  operand++;

  if (operand >= operand_count) { return -1; }
  if (operands[operand].type != OPTYPE_ACCUM) { return -1; }

  opcode |= (operands[operand++].value << 15);

  do
  {
    if (operand >= operand_count) { break; }

    if (operands[operand].value == 8 || operands[operand].value == 9)
    {
      if (parse_dsp_op(operands, operand, operand_count, 8, &xx, &iiii) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (operands[operand].value == 10 || operands[operand].value == 11)
    {
      if (parse_dsp_op(operands, operand, operand_count, 10, &yy, &jjjj) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand < operand_count) { return -1; }

  } while (0);

  opcode |= (mm << 16) | (xx << 12) | (yy << 10) | (iiii << 6) | (jjjj << 2);

  return opcode;
}

static int parse_ed_m_m(
  AsmContext *asm_context,
  struct _operand *operands,
  int operand_count,
  int opcode)
{
  int xx = 0, iiii = 4, jjjj = 4, mm = 0;

  if (operand_count != 5) { return -1; }
  if (parse_mm(asm_context, operands, &mm) == -1) { return -1; }
  if (operands[1].type != OPTYPE_ACCUM) { return -1; }

  opcode |= (operands[1].value << 15);

  if (operands[2].value != 8 && operands[2].value != 9) { return -1; }
  if (parse_wx_wy(&operands[2], 8, &iiii) == -1) { return -1; }

  if (operands[3].value != 10 && operands[3].value != 11) { return -1; }
  if (parse_wx_wy(&operands[3], 10, &jjjj) == -1) { return -1; }

  if (operands[4].type != OPTYPE_REGISTER || operands[4].attribute != 0)
  {
    return -1;
  }

  xx = operands[4].value - 4;

  opcode |= (mm << 16) | (xx << 12) | (iiii << 6) | (jjjj << 2);

  return opcode;
}

static int parse_mac_m_n(
  AsmContext *asm_context,
  struct _operand *operands,
  int operand_count,
  int opcode)
{
  int operand = 0;
  int xx = 0, yy = 0, iiii = 4, jjjj = 4, mmm = 0, aa = 2;

  if (operand >= operand_count) { return -1; }

  if (parse_mmm(asm_context, operands, &mmm) == -1) { return -1; }
  operand++;

  if (operand >= operand_count) { return -1; }

  if (operands[operand].type != OPTYPE_ACCUM) { return -1; }
  opcode |= (operands[operand++].value << 15);

  do
  {
    if (operand >= operand_count) { break; }

    if (operands[operand].value == 8 || operands[operand].value == 9)
    {
      if (parse_dsp_op(operands, operand, operand_count, 8, &xx, &iiii) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (operands[operand].value == 10 || operands[operand].value == 11)
    {
      if (parse_dsp_op(operands, operand, operand_count, 10, &yy, &jjjj) == -1)
      {
        return -1;
      }

      operand += 2;
    }

    if (operand >= operand_count) { break; }

    if (parse_awb(asm_context, &operands[operand], &aa) == -1) { return -1; }

    operand++;

    if (operand < operand_count) { return -1; }

  } while (0);

  opcode |= (mmm << 16) | (xx << 12) | (yy << 10) | (iiii << 6) | (jjjj << 2) | aa;

  return opcode;
}

int parse_instruction_dspic(AsmContext *asm_context, char *instr)
{
  struct _operand operands[7];
  int operand_count = 0;
  char token[TOKENLEN];
  char instr_case[TOKENLEN];
  int flag=FLAG_NONE;
  int token_type;
  int matched;
  int opcode = 0;
  int num;
  int n;

  memset(&operands, 0, sizeof(operands));

  lower_copy(instr_case, instr);

  while (1)
  {
    token_type = tokens_get(asm_context, token, TOKENLEN);
    if (token_type == TOKEN_EOL) { break; }

    if (operand_count == 7)
    {
      print_error_unexp(asm_context, token);
      return -1;
    }

    num = 0;

    if (operand_count == 0)
    {
      if (strcmp(instr_case, "bra") == 0)
      {
        if (is_condition(token) == 1)
        {
          char *s = token;
          while (*s != 0) { *s = tolower(*s); s++; }
          strcat(instr_case, " ");
          strcat(instr_case, token);
          token_type=tokens_get(asm_context, token, TOKENLEN);

          if (IS_NOT_TOKEN(token,','))
          {
            print_error_unexp(asm_context, token);
            return -1;
          }

          token_type = tokens_get(asm_context, token, TOKENLEN);
        }
      }
        else
      if (IS_TOKEN(token,'.'))
      {
        token_type = tokens_get(asm_context, token, TOKENLEN);
        char s[TOKENLEN];
        lower_copy(s, token);

        if (IS_TOKEN(s,'b')) { flag = FLAG_B; }
        else if (IS_TOKEN(s,'w')) { flag = FLAG_W; }
        else if (IS_TOKEN(s,'c')) { flag = FLAG_C; }
        else if (IS_TOKEN(s,'z')) { flag = FLAG_Z; }
        else if (IS_TOKEN(s,'n')) { flag = FLAG_N; }
        else if (IS_TOKEN(s,'d')) { flag = FLAG_D; }
        else if (IS_TOKEN(s,'u')) { flag = FLAG_U; }
        else if (IS_TOKEN(s,'s')) { flag = FLAG_S; }
        else if (IS_TOKEN(s,'r')) { flag = FLAG_R; }
        else if (strcmp(s,"sw") == 0) { flag = FLAG_SW; }
        else if (strcmp(s,"sd") == 0) { flag = FLAG_SD; }
        else if (strcmp(s,"uw") == 0) { flag = FLAG_UW; }
        else if (strcmp(s,"ud") == 0) { flag = FLAG_UD; }
        else if (strcmp(s,"ss") == 0) { flag = FLAG_SS; }
        else if (strcmp(s,"su") == 0) { flag = FLAG_SU; }
        else if (strcmp(s,"us") == 0) { flag = FLAG_US; }
        else if (strcmp(s,"uu") == 0) { flag = FLAG_UU; }
        else
        {
          return -1;
          print_error_unexp(asm_context, token);
        }

        //token_type=tokens_get(asm_context, token, TOKENLEN);
        //if (token_type<0) return -1;

        continue;
      }
    }

    if (IS_TOKEN(token,'a') || IS_TOKEN(token,'A'))
    {
      operands[operand_count].type = OPTYPE_ACCUM;
      num = 0;
    }
      else
    if (IS_TOKEN(token,'b') || IS_TOKEN(token,'B'))
    {
      operands[operand_count].type = OPTYPE_ACCUM;
      num = 1;
    }
      else
    if (IS_TOKEN(token,'#'))
    {
      operands[operand_count].type = OPTYPE_LIT;

      if (eval_expression(asm_context, &num) != 0)
      {
        if (asm_context->pass == 1)
        {
          ignore_operand(asm_context);
        }
          else
        {
          print_error_unexp(asm_context, token);
          return -1;
        }
      }
    }
      else
    if (IS_TOKEN(token,'['))
    {
      operands[operand_count].type = OPTYPE_REGISTER;
      operands[operand_count].attribute = REG_INDIRECT;
      token_type = tokens_get(asm_context, token, TOKENLEN);

      if (IS_TOKEN(token,'+'))
      {
        if (expect_token(asm_context, '+') == -1) { return -1; }

        operands[operand_count].attribute = REG_INDIRECT_PRE_INC;
        token_type = tokens_get(asm_context, token, TOKENLEN);
      }
        else
      if (IS_TOKEN(token,'-'))
      {
        if (expect_token(asm_context, '-') == -1) { return -1; }
        operands[operand_count].attribute = REG_INDIRECT_PRE_DEC;
        token_type = tokens_get(asm_context, token, TOKENLEN);
      }

