mikeakohn/naken_asm/asm/dspic.cpp
      num = get_register_dspic(token);
      if (num < 0)
      {
        print_error_unexp(asm_context, token);
        return -1;
      }
      operands[operand_count].value = num;

      token_type = tokens_get(asm_context, token, TOKENLEN);

      if (IS_TOKEN(token,'+'))
      {
        token_type = tokens_get(asm_context, token, TOKENLEN);
        if (IS_NOT_TOKEN(token,'+'))
        {
          // Check for: [W + #] and [W + W]
          if (IS_TOKEN(token,'#'))
          {
            int a;
            operands[operand_count].type = OPTYPE_W_PLUS_LIT;
            if (eval_expression(asm_context, &a) != 0)
            {
              print_error_unexp(asm_context, token);
              return -1;
            }
            operands[operand_count].attribute = a;
          }
            else
          {
            operands[operand_count].reg2 = get_register_dspic(token);
            if (operands[operand_count].reg2 == -1)
            {
              int a;
              operands[operand_count].type = OPTYPE_W_PLUS_LIT;
              tokens_push(asm_context, token, token_type);

              if (eval_expression(asm_context, &a) != 0)
              {
                print_error_unexp(asm_context, token);
                return -1;
              }
              operands[operand_count].attribute = a;
            }
              else
            {
              operands[operand_count].attribute = REG_INDIRECT_W_PLUS_W;
            }
          }
        }
          else
        {
          operands[operand_count].attribute = REG_INDIRECT_POST_INC;
        }

        token_type = tokens_get(asm_context, token, TOKENLEN);
      }
        else
      if (IS_TOKEN(token,'-'))
      {
        token_type = tokens_get(asm_context, token, TOKENLEN);

        if (IS_TOKEN(token, '-'))
        {
          operands[operand_count].attribute = REG_INDIRECT_POST_DEC;
        }
          else
        {
          int a;
          operands[operand_count].type = OPTYPE_W_PLUS_LIT;
          tokens_push(asm_context, token, token_type);

          if (eval_expression(asm_context, &a) != 0)
          {
            print_error_unexp(asm_context, token);
            return -1;
          }

          operands[operand_count].attribute = -a;
        }

        token_type = tokens_get(asm_context, token, TOKENLEN);
      }

      if (IS_NOT_TOKEN(token,']'))
      {
        print_error_unexp(asm_context, token);
        return -1;
      }

      token_type = tokens_get(asm_context, token, TOKENLEN);

      if (IS_TOKEN(token,'-') || IS_TOKEN(token,'+'))
      {
        operands[operand_count].type = OPTYPE_W_OP_EQ_NUM;
        int a = 1;

        if (IS_TOKEN(token,'-')) { a = -1; }
        if (expect_token(asm_context, '=') == -1) { return -1; }

        int temp;
        if (eval_expression(asm_context, &temp) != 0)
        {
          print_error_unexp(asm_context, token);
          return -1;
        }

        operands[operand_count].attribute = a * temp;
      }
        else
      {
        tokens_push(asm_context, token, token_type);
      }
    }
      else
    if (strcasecmp(token, "wreg") == 0)
    {
      operands[operand_count].type=OPTYPE_WREG;
    }
      else
    {
      num=get_register_dspic(token);
      if (num >= 0)
      {
        operands[operand_count].type = OPTYPE_REGISTER;
        token_type = tokens_get(asm_context, token, TOKENLEN);

        if (IS_TOKEN(token,'*'))
        {
          token_type = tokens_get(asm_context, token, TOKENLEN);
          operands[operand_count].reg2 = get_register_dspic(token);
          if (operands[operand_count].reg2 == -1)
          {
            print_error_unexp(asm_context, token);
            return -1;
          }
          operands[operand_count].type = OPTYPE_W_MUL_W;
        }
          else
        {
          tokens_push(asm_context, token, token_type);
        }
      }
        else
      {
        operands[operand_count].type = OPTYPE_NUM;
        tokens_push(asm_context, token, token_type);

        if (eval_expression(asm_context, &num) != 0)
        {
          if (asm_context->pass == 1)
          {
            ignore_operand(asm_context);
          }
            else
          {
            print_error_unexp(asm_context, token);
            return -1;
          }
        }
      }
    }

    operands[operand_count++].value = num;

    token_type = tokens_get(asm_context, token, TOKENLEN);
    if (token_type == TOKEN_EOL) { break; }
    if (IS_NOT_TOKEN(token,','))
    {
      print_error_unexp(asm_context, token);
      return -1;
    }
  }

#ifdef DEBUG
  printf("-------- instr=%s  flag=%d operand_count=%d\n", instr, flag, operand_count);
  char *types[]= { "ERROR", "REGISTER", "WREG", "LIT", "NUM", "ACCUM", "W_PLUS_LIT", "W_OP_EQ_NUM", "W_MUL_W" };
  for (n = 0; n < operand_count; n++)
  {
    printf("operand %d: value=%d type=%s (%d) attribute=%d reg2=%d\n",
      n,
      operands[n].value,
      types[operands[n].type],
      operands[n].type,
      operands[n].attribute,
      operands[n].reg2);
  }
#endif

  // On pass 1 only calculate address.
  if (asm_context->pass == 1)
  {
    add_bin32(asm_context, 0x0000000, IS_OPCODE);

    if (strcmp("do", instr_case) == 0 ||
        (((strcmp("goto", instr_case) == 0 || strcmp("call", instr_case) == 0)
         && operand_count == 1 &&
         operands[0].type != OPTYPE_REGISTER)))
    {
      add_bin32(asm_context, 0x0000000, IS_OPCODE);
      return 8;
    }

    return 4;
  }

  n = 0;
  matched = 0;

  while (table_dspic[n].name != NULL)
  {
    if (asm_context->cpu_type == CPU_TYPE_PIC24 && table_dspic[n].dspic)
    {
      n++;
      continue;
    }

    if (strcmp(table_dspic[n].name, instr_case) == 0)
    {
      matched = 1;

      switch (table_dspic[n].type)
      {
        case OP_NONE:
          if (operand_count == 0 && flag == FLAG_NONE)
          {
            add_bin32(asm_context, table_dspic[n].opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            if (check_f(asm_context, operands[0].value) == -1) { return -1; }

