mikeakohn/naken_asm/asm/dspic.cpp
            add_bin32(asm_context, table_dspic[n].opcode | operands[0].value, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F_WREG:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            if (check_f_flag(asm_context, operands[0].value, flag) == -1)
            {
              return -1;
            }
            add_bin32(asm_context, table_dspic[n].opcode | (flag == FLAG_B ? (1 << 14) : 0) | (1 << 13) | operands[0].value, IS_OPCODE);
            return 4;
          }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_NUM && operands[1].type == OPTYPE_WREG)
          {
            if (check_f_flag(asm_context, operands[0].value, flag) == -1)
            {
              return -1;
            }
            add_bin32(asm_context, table_dspic[n].opcode | (flag == FLAG_B ? (1 << 14) : 0) | operands[0].value, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F_OR_WREG:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            if (check_f_flag(asm_context, operands[0].value, flag) == -1)
            {
              return -1;
            }
            add_bin32(asm_context, table_dspic[n].opcode | (flag == FLAG_B ? (1 << 14) : 0) | (1 << 13) | operands[0].value, IS_OPCODE);
            return 4;
          }
          if (operand_count == 1 && operands[0].type == OPTYPE_WREG)
          {
            add_bin32(asm_context, table_dspic[n].opcode | (flag == FLAG_B ? (1 << 14) : 0) | operands[0].value, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WREG_F:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_WREG && operands[1].type == OPTYPE_NUM)
          {
            if (check_f_flag(asm_context, operands[0].value, flag )== -1)
            {
              return -1;
            }
            opcode = table_dspic[n].opcode | operands[1].value;
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_ACC:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_ACCUM)
          {
            add_bin32(asm_context, table_dspic[n].opcode | (operands[0].value << 15), IS_OPCODE);
            return 4;
          }
          break;
        case OP_ACC_LIT4_WD:
          if (flag != FLAG_NONE && flag != FLAG_R) { break; }
          opcode = table_dspic[n].opcode | ((flag == FLAG_R) ? (1 << 16) : 0);
          opcode |= (operands[0].value << 15);

          if (operand_count == 2 &&
              operands[0].type == OPTYPE_ACCUM &&
              operands[1].type == OPTYPE_REGISTER)
          {
            opcode |= operands[1].value;
            opcode |= (operands[1].attribute << 4);
            if (operands[1].attribute == 6) { opcode |= (operands[1].reg2 << 11); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_ACCUM &&
              operands[1].type == OPTYPE_LIT &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (check_range(asm_context, "Literal", operands[1].value, -8, 7) == -1) { return -1; }
            opcode |= (((uint32_t)(operands[1].value & 0xf)) << 7);
            opcode |= operands[2].value;
            opcode |= (operands[2].attribute << 4);
            if (operands[2].attribute == 6) { opcode |= (operands[2].reg2 << 11); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_ACC_LIT6:
          if (flag != FLAG_NONE) { break; }

          if (operand_count == 2 &&
              operands[0].type == OPTYPE_ACCUM &&
              operands[1].type == OPTYPE_LIT)
          {
            if (check_range(asm_context, "Literal", operands[1].value, -16, 16) == -1) { return -1; }
            opcode = table_dspic[n].opcode;
            opcode |= (operands[0].value << 15);
            opcode |= ((uint32_t)(operands[1].value & 0x3f));
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_ACC_WB:
          if (flag != FLAG_NONE) { break; }

          if (operand_count == 2 &&
              operands[0].type == OPTYPE_ACCUM &&
              operands[1].type == OPTYPE_REGISTER)
          {
            opcode = table_dspic[n].opcode;
            opcode |= (operands[0].value << 15);
            opcode |= operands[1].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_BRA:
          if (flag != FLAG_NONE) { break; }

          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            int offset=operands[0].value-((asm_context->address/2)+2);
            if ((offset & 1) != 0)
            {
              print_error(asm_context, "Address not on 16 bit boundary");
              return -1;
            }
            if (check_range(asm_context, "Offset", offset, -32768*2, 32767*2) == -1) { return -1; }
            offset = offset / 2;
            opcode = table_dspic[n].opcode;
            opcode |= (offset & 0xffff);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_CP0_WS:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute>5) { break; }

            opcode = table_dspic[n].opcode;
            opcode |= operands[0].value;
            opcode |= operands[0].attribute << 4;
            if (flag == FLAG_B) { opcode |= (1 << 10); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_CP_F:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            if (check_f_flag(asm_context, operands[0].value, flag) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value;
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_D_WNS_WND_1:
          if (flag != FLAG_D) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[1].attribute > 5) { break; }
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute == 0 && (operands[1].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            if ((operands[0].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            opcode = table_dspic[n].opcode | ((operands[0].value / 2) << 1) |
                   (operands[1].attribute << 11) | (operands[1].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_D_WNS_WND_2:
          if (flag != FLAG_D) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute > 5) { break; }
            if (operands[1].attribute != 0) { break; }
            if (operands[0].attribute == 0 && (operands[0].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            if ((operands[1].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            opcode = table_dspic[n].opcode | operands[0].value |
                   (operands[0].attribute << 4) |
                  ((operands[1].value / 2) << 8);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F_BIT4:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_NUM &&
              operands[1].type == OPTYPE_LIT)
          {
            if (check_f_flag(asm_context, operands[0].value, flag) == -1) { return -1; }
            opcode = table_dspic[n].opcode;
            if (flag == FLAG_B)
            {
              if (check_range(asm_context, "Literal", operands[1].value, 0, 7) == -1) { return -1; }
              opcode |= operands[0].value;
              opcode |= operands[1].value << 13;
            }
              else
            {
              if (check_range(asm_context, "Literal", operands[1].value, 0, 15) == -1) { return -1; }
              opcode |= operands[0].value;
              opcode |= (operands[1].value & 0x7) << 13;

              if (operands[1].value > 7) { opcode |= 1; }
            }

            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F_BIT4_2:
          if (flag == FLAG_NONE) { flag = FLAG_Z; }
          if (flag != FLAG_C && flag != FLAG_Z) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT)
          {
            if (check_range(asm_context, "Literal", operands[1].value, 0, 15) == -1) { return -1; }
            if (operands[0].attribute>5) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[1].value << 12);
            if (flag == FLAG_Z) { opcode |= (1 << 11); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_F_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_NUM &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (check_f_64k(asm_context, operands[0].value) == -1) { return -1; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                   (operands[0].value << 3);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_GOTO:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_NUM)
          {
            if (check_range(asm_context, "Address", operands[0].value, 0, 0x7ffffe) == -1) { return -1; }
            opcode = table_dspic[n].opcode | (operands[0].value & 0xffff);
            add_bin32(asm_context, opcode, IS_OPCODE);
            add_bin32(asm_context, operands[0].value>>16, IS_OPCODE);
            return 8;
          }
          break;
        case OP_LIT1:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_LIT)
          {
            if (check_range(asm_context, "Literal", operands[0].value, 0, 1) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_LIT10_WN:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_LIT &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (check_range(asm_context, "Literal", operands[0].value, 0, 0x3ff) == -1) { return -1; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value;
            opcode |= operands[0].value << 4;
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_LIT14:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_LIT)
          {
            if (check_range(asm_context, "Literal", operands[0].value, 0, 0x3fff) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_LIT14_EXPR:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_LIT &&
              operands[1].type == OPTYPE_NUM)
          {
            int offset=operands[1].value-((asm_context->address/2)+2);
            if (check_range(asm_context, "Literal", operands[0].value, 0, 0x3fff) == -1) { return -1; }
            if ((offset & 1) != 0)
            {
              print_error(asm_context, "Address not on 16 bit boundary");
              return -1;
            }
            if (check_range(asm_context, "Offset", offset, -32768*2, 32767*2) == -1) { return -1; }
            offset = offset / 2;
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            add_bin32(asm_context, offset & 0xffff, IS_OPCODE);
            return 8;
          }
          break;
        case OP_LIT16_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_LIT &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (check_range(asm_context, "Literal", operands[0].value, -32768, 0xffff) == -1) { return -1; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode |
                   ((operands[0].value & 0xffff) << 4) |
                     operands[1].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }

          break;
        case OP_LIT8_WND:
          if (flag != FLAG_B) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_LIT &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (check_range(asm_context, "Literal", operands[0].value, -128, 0xff) == -1) { return -1; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | ((operands[0].value & 0xff) << 4) |
                     operands[1].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_LNK_LIT14:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_LIT)
          {
            if (check_range(asm_context, "Literal", operands[0].value, 0, 0x3ffe) == -1) { return -1; }
            if ((operands[0].value & 1) != 0)
            {
              print_error(asm_context, "Address not on 16 bit boundary");
              return -1;
            }
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_POP_D_WND:
          if (flag != FLAG_D) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if ((operands[0].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            opcode = table_dspic[n].opcode | ((operands[0].value / 2) << 8);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_POP_S:
          if (flag != FLAG_S) { break; }
          if (operand_count == 0)
          {
            add_bin32(asm_context, table_dspic[n].opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_POP_WD:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            opcode = table_dspic[n].opcode | (operands[0].value << 7)|
                   (operands[0].attribute << 11) | (operands[0].reg2 << 15);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_PUSH_D_WNS:
          if (flag != FLAG_D) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if ((operands[0].value & 1)!= 0)
            {
              print_error(asm_context, "Illegal register for double");
              return -1;
            }
            opcode = table_dspic[n].opcode | ((operands[0].value / 2) << 1);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_SS_WB_WS_WND:
        case OP_SU_WB_WS_WND:
        case OP_US_WB_WS_WND:
        case OP_UU_WB_WS_WND:
          if (flag != FLAG_SS && table_dspic[n].type == OP_SS_WB_WS_WND) { break; }
          if (flag != FLAG_SU && table_dspic[n].type == OP_SU_WB_WS_WND) { break; }
          if (flag != FLAG_US && table_dspic[n].type == OP_US_WB_WS_WND) { break; }
          if (flag != FLAG_UU && table_dspic[n].type == OP_UU_WB_WS_WND) { break; }
          if (operand_count == 3 && operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute > 5) { break; }
            if (operands[2].attribute != 0) { break; }
            if ((operands[2].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for Wnd");
              return -1;
            }
            opcode = table_dspic[n].opcode | (operands[0].value << 11) |
                   operands[1].value | (operands[1].attribute << 4) |
                   (operands[2].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_SU_WB_LIT5_WND:
        case OP_UU_WB_LIT5_WND:
          if (flag != FLAG_SU && table_dspic[n].type == OP_SU_WB_LIT5_WND) {break; }
          if (flag != FLAG_UU && table_dspic[n].type == OP_UU_WB_LIT5_WND) {break; }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[2].attribute != 0) { break; }
            if (check_range(asm_context, "Literal", operands[1].value, 0, 31) == -1) { return -1; }
            if ((operands[2].value & 1) != 0)
            {
              print_error(asm_context, "Illegal register for Wnd");
              return -1;
            }
            opcode = table_dspic[n].opcode | (operands[0].value << 11) |
                     operands[1].value | (operands[2].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_S_WM_WN:
        case OP_U_WM_WN:
          if ((flag != FLAG_U && flag != FLAG_UW && flag != FLAG_UD) &&
               table_dspic[n].type == OP_U_WM_WN) { break; }
          if ((flag != FLAG_S && flag != FLAG_SW && flag != FLAG_SD) &&
               table_dspic[n].type == OP_S_WM_WN) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                   (operands[0].value << 7);
            if (flag == FLAG_UD || flag == FLAG_SD)
            {
              if ((operands[0].value & 1) != 0)
              {
                print_error(asm_context, "Illegal register for double");
                return -1;
              }
              opcode |= (1 << 6);
              opcode |= ((operands[0].value + 1) << 11);
            }

