mikeakohn/naken_asm/asm/dspic.cpp
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_LIT4_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 3 && operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[2].attribute != 0) { break; }
            if (check_range(asm_context, "Literal", operands[1].value, 0, 15) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[1].value |
                   (operands[0].value << 11) | (operands[2].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_LIT5:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT)
          {
            if (operands[0].attribute != 0) { break; }
            if (check_range(asm_context, "Literal", operands[1].value, 0, 31) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[1].value |
                    (operands[0].value << 11);
            if (flag == FLAG_B) { opcode |= (1 << 10); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_LIT5_WD:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[2].attribute == 6) { break; }
            if (check_range(asm_context, "Literal", operands[1].value, 0, 31) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[1].value |
                    (operands[0].value << 15)|(operands[2].value << 7) |
                    (operands[2].attribute << 11);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_WN:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 && operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                    (operands[0].value << 11);
            if (flag == FLAG_B) { opcode |= (1 << 10); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_WNS_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute != 0) { break; }
            if (operands[2].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                    (operands[0].value << 11) | (operands[2].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_WS:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute > 5) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                   (operands[0].value << 11) | (operands[1].attribute << 4);
            if (flag == FLAG_B) { opcode |= (1 << 10); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WB_WS_WD:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER &&
              operands[2].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute > 5) { break; }
            if (operands[2].attribute > 5) { break; }
            opcode = table_dspic[n].opcode | operands[1].value|
                    (operands[0].value << 15) | (operands[1].attribute << 4) |
                    (operands[2].value << 7) | (operands[2].attribute << 11);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WD:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute > 5) { break; }
            opcode = table_dspic[n].opcode | (operands[0].value << 7) |
                    (operands[0].attribute << 11);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WN:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_B_WN:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value;
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_DAW_B_WN:
          if (flag != FLAG_B) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WN_EXPR:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_NUM)
          {
            if (operands[0].attribute != 0) { break; }
            int offset=operands[1].value-((asm_context->address/2)+2);
            if ((offset & 1) != 0)
            {
              print_error(asm_context, "Address not on 16 bit boundary");
              return -1;
            }
            if (check_range(asm_context, "Offset", offset, -32768*2, 32767*2) == -1) { return -1; }
            offset = offset / 2;
            opcode = table_dspic[n].opcode | operands[0].value;
            add_bin32(asm_context, opcode, IS_OPCODE);
            add_bin32(asm_context, offset & 0xffff, IS_OPCODE);
            return 8;
          }
          break;
        case OP_WNS_F:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_NUM)
          {
            if (operands[0].attribute != 0) { break; }
            if (check_f_64k(asm_context, operands[1].value) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value |
                   ((operands[1].value >> 1) << 4);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WNS_WD_LIT10:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_W_PLUS_LIT)
          {
            if (operands[0].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                   (operands[1].value << 7);
            num = operands[1].attribute;
            if (flag == FLAG_B)
            {
              if (check_range(asm_context, "Literal", num, -512, 511) == -1) { return -1; }
              opcode |= (1 << 14);
            }
              else
            {
              if (check_range(asm_context, "Literal", num, -1024, 1022) == -1) { return -1; }
              if ((num & 1) == 1)
              {
                print_error(asm_context, "Literal not an even number");
                return -1;
              }
              num = num / 2;
            }
            opcode |= (num & 0x7) << 4;
            opcode |= ((num >> 3) & 0x7) << 11;
            opcode |= ((num >> 6) & 0xf) << 15;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WNS_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[1].value << 7);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_BIT4:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT)
          {
            if (operands[0].attribute > 5) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[1].value << 12);
            if (flag == FLAG_B)
            {
              opcode |= (1 << 10);
              if (check_range(asm_context, "Literal", operands[1].value, 0, 7) == -1) { return -1; }
            }
              else
            {
              if (check_range(asm_context, "Literal", operands[1].value, 0, 15) == -1) { return -1; }
            }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_BIT4_2:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT)
          {
            if (operands[0].attribute>5) { break; }
            if (check_range(asm_context, "Literal", operands[1].value, 0, 15) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[1].value << 12);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_LIT10_WND:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_W_PLUS_LIT &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[1].value << 7);
            num = operands[0].attribute;
            if (flag == FLAG_B)
            {
              if (check_range(asm_context, "Literal", num, -512, 511) == -1) { return -1; }
              opcode |= (1 << 14);
            }
              else
            {
              if (check_range(asm_context, "Literal", num, -1024, 1022) == -1) { return -1; }
              if ((num & 1) == 1)
              {
                print_error(asm_context, "Literal not an even number");
                return -1;
              }
              num = num / 2;
            }
            opcode |= (num & 0x7) << 4;
            opcode |= ((num >> 3) & 0x7) << 11;
            opcode |= ((num >> 6) & 0xf) << 15;
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_LIT4_ACC:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 3 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_LIT &&
              operands[2].type == OPTYPE_ACCUM)
          {
            if (check_range(asm_context, "Literal", operands[1].value, -8, 7) == -1) { return -1; }
            opcode = table_dspic[n].opcode | operands[0].value |
                   (operands[0].attribute << 4) |
                  ((operands[1].value & 0xf) << 7) |
                   (operands[0].reg2 << 11)|
                   (operands[2].value << 15);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_ACCUM)
          {
            opcode = table_dspic[n].opcode | operands[0].value |
                   (operands[0].attribute << 4)|
                   (operands[0].reg2 << 11) | (operands[1].value << 15);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_PLUS_WB:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 1 && operands[0].type == OPTYPE_REGISTER)
          {
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[0].reg2 << 15);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_WB:
          if (flag == FLAG_NONE) { flag = FLAG_Z; }
          if (flag != FLAG_C && flag != FLAG_Z) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute == 6) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[1].value << 11);
            if (flag == FLAG_Z) { opcode |= (1 << 15); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_WB_WD_WB:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute == 6 && operands[1].attribute == 6 &&
                operands[0].reg2 != operands[1].reg2)
            {
              print_error(asm_context, "Source and destination Wb don't match");
              return -1;
            }

            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[0].reg2 << 15) |
                    (operands[1].value << 7) | (operands[1].attribute << 11);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_WD:
          if (flag != FLAG_NONE && flag != FLAG_B && flag != FLAG_W) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute == 6) { break; }
            if (operands[1].attribute == 6) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) |
                    (operands[1].value << 7) | (operands[1].attribute << 11);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WS_WND:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute == 6) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[0].value |
                    (operands[0].attribute << 4) | (operands[1].value << 7);
            if (flag == FLAG_B) { opcode |= (1 << 14); }
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_WM_WN:
          if (flag != FLAG_NONE) { break; }
          if (operand_count == 2 &&
              operands[0].type == OPTYPE_REGISTER &&
              operands[1].type == OPTYPE_REGISTER)
          {
            if (operands[0].attribute != 0) { break; }
            if (operands[1].attribute != 0) { break; }
            opcode = table_dspic[n].opcode | operands[1].value |
                    (operands[0].value << 11);
            add_bin32(asm_context, opcode, IS_OPCODE);
            return 4;
          }
          break;
        case OP_A_WX_WY_AWB:
          if (flag != FLAG_NONE) { break; }
          opcode = parse_movsac(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        case OP_N_WM_WN_ACC_WX_WY:
          if (flag != FLAG_N) { break; }
          opcode = parse_mpy_n(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        case OP_WM_WM_ACC_WX_WY:
          if (flag != FLAG_NONE) { break; }
          opcode = parse_mac_m_m(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        case OP_WM_WN_ACC_WX_WY:
          if (flag != FLAG_NONE) { break; }
          opcode = parse_mpy_n(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        case OP_WM_WM_ACC_WX_WY_WXD:
          if (flag != FLAG_NONE) { break; }
          opcode = parse_ed_m_m(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        case OP_WM_WN_ACC_WX_WY_AWB:
          if (flag != FLAG_NONE) { break; }
          opcode = parse_mac_m_n(asm_context, operands, operand_count, table_dspic[n].opcode);
          if (opcode == -1) { break; }
          add_bin32(asm_context, opcode, IS_OPCODE);
          return 4;
          break;
        default:
          break;
      }
    }

    n++;
  }

  if (matched == 1)
  {
    print_error_unknown_operand_combo(asm_context, instr);
  }
    else
  {
    print_error_unknown_instr(asm_context, instr);
  }

  asm_context->error = 1;

  return 4;
}

